{
  "class_name": "Sequential",
  "keras_version": "2.0.4",
  "config": [
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "normal",
            "scale": 2,
            "seed": null,
            "mode": "fan_in"
          }
        },
        "name": "dense_25",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "dtype": "float32",
        "activation": "elu",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 256,
        "batch_input_shape": [
          null,
          10000
        ],
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.2,
        "trainable": true,
        "name": "dropout_19"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "normal",
            "scale": 2,
            "seed": null,
            "mode": "fan_in"
          }
        },
        "name": "dense_26",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "elu",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 256,
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.2,
        "trainable": true,
        "name": "dropout_20"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "normal",
            "scale": 2,
            "seed": null,
            "mode": "fan_in"
          }
        },
        "name": "dense_27",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "elu",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 256,
        "use_bias": true,
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "rate": 0.2,
        "trainable": true,
        "name": "dropout_21"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "scale": 1,
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "name": "dense_28",
        "kernel_constraint": null,
        "bias_regularizer": null,
        "bias_constraint": null,
        "activation": "softmax",
        "trainable": true,
        "kernel_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "units": 4,
        "use_bias": true,
        "activity_regularizer": null
      }
    }
  ],
  "backend": "tensorflow"
}